import React from 'react';
import ReactDOM from 'react-dom';
import SQ from '../src/sq-components';

const styles = {
  slide: {
    padding: 15,
    color: '#fff',
  },
  slide1: {
    background: '#FEA900',
    height:'1300px'
  },
  slide2: {
    background: '#B3DC4A',
  },
  slide3: {
    background: '#6AC0FF',

  },
};


var App = React.createClass({

  render () {

    return (
    <SQ.SwipeViews fill>
    	<SQ.SwipeItemView fill scrollable style={Object.assign({}, styles.slide, styles.slide1)}>
    		<div>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
    		</div>
    	</SQ.SwipeItemView>
    	<SQ.SwipeItemView fill scrollable style={Object.assign({}, styles.slide, styles.slide2)}>
    	<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
<p>近日有玩家发现国服战网的积分兑换系统推出了新的可兑换服务 - “战网昵称修改资格”一次。一般来说每个战网账号都有一次修改昵称的机会，但修改后再无法对其修改了。这项举措的推出对于那些手滑或是留有遗憾的玩家来说可谓重大利好。</p>
    	</SQ.SwipeItemView>
    	<SQ.SwipeItemView fill scrollable style={Object.assign({}, styles.slide, styles.slide3)}>
    	    	slide n°3
    	</SQ.SwipeItemView>
    </SQ.SwipeViews>
    );
  }
});

ReactDOM.render(<App />, document.getElementById('example'));
